In [26]:
import pandas as pd
df = pd.read_csv("students.csv")
df.rename(columns={"Marks":"Score"}, inplace=True)
df

    StudentID    Name  Class  Subject  Score  Attendance
0         101   Aarav     10     Math   85.0        92.0
1         102    Neha     10  Science   92.0        88.0
2         103   Rahul     10     Math   78.0         NaN
3         104   Priya      9  Science   65.0        80.0
4         105   Karan      9     Math    NaN        70.0
5         106  Simran      9  English   88.0        90.0
6         107   Ankit     10  English   55.0        60.0
7         108   Pooja      9     Math   73.0         NaN
8         109   Rohit     10  Science   90.0        85.0
9         110   Sneha      9  English   82.0        95.0
10        111   Arjun     10     Math    NaN        78.0
11        112   Meera      9  Science   69.0         NaN

In [27]:
df.drop("Attendance", axis=1, inplace=True)
df

    StudentID    Name  Class  Subject  Score
0         101   Aarav     10     Math   85.0
1         102    Neha     10  Science   92.0
2         103   Rahul     10     Math   78.0
3         104   Priya      9  Science   65.0
4         105   Karan      9     Math    NaN
5         106  Simran      9  English   88.0
6         107   Ankit     10  English   55.0
7         108   Pooja      9     Math   73.0
8         109   Rohit     10  Science   90.0
9         110   Sneha      9  English   82.0
10        111   Arjun     10     Math    NaN
11        112   Meera      9  Science   69.0

In [ ]:
print(df["Score"].dtypes)
df["Score"] = df["Score"].astype(int)
df["Score"].dtypes

float64

dtype('int64')

In [45]:
print(df["Class"].dtypes)
df["Class"] = df["Class"].astype(str)
df["Class"].dtypes

int64

dtype('O')

In [47]:
def fun(x):
    if x>=50:
        return "Pass"
    else:
        return "Fail"
df["Result"]= df["Score"].apply(fun)
df

    StudentID    Name Class  Subject  Score Result
0         101   Aarav    10     Math     85   Pass
1         102    Neha    10  Science     92   Pass
2         103   Rahul    10     Math     78   Pass
3         104   Priya     9  Science     65   Pass
4         105   Karan     9     Math      0   Fail
5         106  Simran     9  English     88   Pass
6         107   Ankit    10  English     55   Pass
7         108   Pooja     9     Math     73   Pass
8         109   Rohit    10  Science     90   Pass
9         110   Sneha     9  English     82   Pass
10        111   Arjun    10     Math      0   Fail
11        112   Meera     9  Science     69   Pass

In [49]:
def fun(x):
    if x>=90:
        return "A"
    elif x<90 and x>=80:
        return "B"
    elif x<80 and x>=70:
        return "C"
    elif x<70 and x>=60:
        return "D"
    elif x<60 and x>=40:
        return "E"
    else:
        return "F"
df["Grade"]= df["Score"].apply(fun)
df

    StudentID    Name Class  Subject  Score Result Grade
0         101   Aarav    10     Math     85   Pass     B
1         102    Neha    10  Science     92   Pass     A
2         103   Rahul    10     Math     78   Pass     C
3         104   Priya     9  Science     65   Pass     D
4         105   Karan     9     Math      0   Fail     F
5         106  Simran     9  English     88   Pass     B
6         107   Ankit    10  English     55   Pass     E
7         108   Pooja     9     Math     73   Pass     C
8         109   Rohit    10  Science     90   Pass     A
9         110   Sneha     9  English     82   Pass     B
10        111   Arjun    10     Math      0   Fail     F
11        112   Meera     9  Science     69   Pass     D

In [52]:
x = [-1,40,60,75,100]
y = ["Fail","Average","Good","V Good"]

df["Performance"] = pd.cut(
    df["Score"], 
    bins=x, 
    labels=y
)
df

    StudentID    Name Class  Subject  Score Result Grade Performance
0         101   Aarav    10     Math     85   Pass     B      V Good
1         102    Neha    10  Science     92   Pass     A      V Good
2         103   Rahul    10     Math     78   Pass     C      V Good
3         104   Priya     9  Science     65   Pass     D        Good
4         105   Karan     9     Math      0   Fail     F        Fail
5         106  Simran     9  English     88   Pass     B      V Good
6         107   Ankit    10  English     55   Pass     E     Average
7         108   Pooja     9     Math     73   Pass     C        Good
8         109   Rohit    10  Science     90   Pass     A      V Good
9         110   Sneha     9  English     82   Pass     B      V Good
10        111   Arjun    10     Math      0   Fail     F        Fail
11        112   Meera     9  Science     69   Pass     D        Good

In [53]:
df["Performance"].value_counts()

Performance
V Good     6
Good       3
Fail       2
Average    1
Name: count, dtype: int64

In [54]:
df.groupby("Subject")["Score"].agg(["mean","max","min","count"])

         mean  max  min  count
Subject
English  75.0   88   55      3
Math     47.2   85    0      5
Science  79.0   92   65      4

In [ ]:
df.sort_index()

    StudentID    Name Class  Subject  Score Result Grade Performance
0         101   Aarav    10     Math     85   Pass     B      V Good
1         102    Neha    10  Science     92   Pass     A      V Good
2         103   Rahul    10     Math     78   Pass     C      V Good
3         104   Priya     9  Science     65   Pass     D        Good
4         105   Karan     9     Math      0   Fail     F        Fail
5         106  Simran     9  English     88   Pass     B      V Good
6         107   Ankit    10  English     55   Pass     E     Average
7         108   Pooja     9     Math     73   Pass     C        Good
8         109   Rohit    10  Science     90   Pass     A      V Good
9         110   Sneha     9  English     82   Pass     B      V Good
10        111   Arjun    10     Math      0   Fail     F        Fail
11        112   Meera     9  Science     69   Pass     D        Good

In [56]:
df.to_csv("latest_students_data.csv", index=False)